/******************************************************************************/
/* This is a mundane include file but it does have a long name !              */


	dcl p		ptr;
	dcl b(10)		bit(16) static;
	dcl name		char(256) var;

	name = 'This-is-a-longish-text-string-but-it-wont-compile';

/* end of include */

	