defbug:

   proc;

   dcl a       def (c) bin(15);
   dcl b       def (a) bin(15);
   dcl c       def (b) bin(15); 

/*   a = 0; */
/*   b = 0; */
   c = 0;
   

   end;

