              2 class           ptr,
              2 state           bin(15),  
              2 d               char(8),  
              2 group(6),
                4 name          char(77) var,
                4 code          dec(2),
                4 address       char(128) var;
