loopy:

   proc options(main);

   dcl X               bin(15);
   dcl (a,b,c,d)       bin(15);

   do a = 1 to 100;
      do b = 1 to 10;
         do c = 1 to 10;
            do d = 1 to 10; 
               X = a + b + c + d;
           
            end; 
         end; 
      end; 
   end;

end;
