
math:

   proc options(main);

   dcl (a,b,c)             bin(15);

       a = 10;

       b = 50;

       c = a * b;

       b = c / a;

       end;


