

        /*************************************************************/
        /* test2 the second include file used by incl.pl1 !!!        */
        /*************************************************************/


        age = 23.5;

        dcl 1 critical,
              2 lock            bin(15),
              2 age             bin(31),
              2 stats,
                3 number        fixed dec(18),
                3 remotes       fixed dec(2)



  
